

# Словарь компаний, где ключ - название компании, значение - список моделей
companies = {
   "Honda": {
        "Honda eNS1": {
            "Год выпуска": 2022,
            "Характеристики": "Honda e:NS1",
            "Фото": "https://static.tildacdn.com/stor6436-3264-4432-b764-366463343961/32280260.jpg",
            "Комплектации": {
                "Базовая комплектация": {
                    "description": "Базовая комплектация",
                    "price": "$9,000,000 (при 100% оплате будет $8,200,000)",
                    "mileage": "-",
                    "drive": "Полный",
                    "power": "134kW (182 л.с.)",
                    "capacity": "53.6 кВт*ч",
                    #added fields
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅", 
                    # 
                },
                "Полная комплектация": {
                    "description": "Полная комплектация",
                    "price": "$11,000,000 (при 100% оплате будет $10,200,000)",
                    "mileage": "-",
                    "drive": "Полный",
                    "power": "150kW (204 л.с.)",
                    "capacity": "68.8 кВт*ч",
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅", 
                },
            },
        },
        "Honda eNP1": {
            "Год выпуска": 2022,
            "Характеристики": "Honda e:NP1",
            "Фото": "https://static.tildacdn.com/stor6436-3264-4432-b764-366463343961/32280260.jpg",
            "Комплектации": {
                "Базовая комплектация": {
                    "description": "Базовая комплектация",
                    "price": "$9,000,000",
                    "mileage": "-",
                    "drive": "Полный",
                    "power": "134kW",
                    "capacity": "53.6 кВт*ч",
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅", 
                },
                "Полная комплектация": {
                    "description": "Полная комплектация",
                    "price": "$11,000,000 (при 100% оплате будет $10,200,000)",
                    "mileage": "-",
                    "drive": "Полный",
                    "power": "150kW",
                    "capacity": "68.8 кВт*ч",
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅",
                },
            },
        },
    },
    "Zeekr": {
        "Zeekr 001": {
            "Год выпуска": 2023,
            "Характеристики": "Zeekr 001",
            "Фото":     "https://static.tildacdn.com/stor6436-3264-4432-b764-366463343961/32280260.jpg",
            "Комплектации": {
                "WE": {
                    "description": "Описание",
                    "price": "$44000 - 45000",
                    "mileage": "",
                    "drive": "Полный",
                    "power": "400kW",
                    "capacity": "86,0 кВт*ч",
                    "max_speed": "150 км/ч",
                    "torque": "768 н.м",
                    "push_start": "✅",
                    
                },
                "Комплектация 2.1.2": {
                    "description": "Описание 2.1.2",
                    "price": "$58 000",
                    "mileage": "750km",
                    "drive": "Задний",
                    "power": "320kW",
                    "capacity": "85kWh",
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅",
                },
            },
        },
        "Zeekr X": {
            "Год выпуска": 2022,
            "Характеристики": "Характеристики модели 2.2",
            "Фото":     "https://static.tildacdn.com/stor6436-3264-4432-b764-366463343961/32280260.jpg",
            "Комплектации": {
                "Комплектация 2.2.1": {
                    "description": "Описание 2.2.1",
                    "price": "$48 000",
                    "mileage": "550km",
                    "drive": "Полный",
                    "power": "350kW",
                    "capacity": "90kWh",
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅",
                },
                "Комплектация 2.2.2": {
                    "description": "Описание 2.2.2",
                    "price": "$52 000",
                    "mileage": "600km",
                    "drive": "Задний",
                    "power": "300kW",
                    "capacity": "80kWh",
                    "max_speed": "150 км/ч",
                    "torque": "310 н.м",
                    "push_start": "✅",
                },
            },
        },
    },
}